Config = Config or {}
Config.AnnouceTimer = 5 * 1000
Config.AutoAnnouce = true
Config.AnnouceInterval = 10 * 60 * 1000  -- 10 * 60 * 1000 
Config.Annoucement = {
    'MJDEV :  ยินดีต้อนรับทุกท่าน',
    'MJDEV :  กรุณาอ่านกฎก่อนเล่น.',
    'MJDEV :  สามารถติดต่อสอบถามได้ 24 ซม.',
    'MJDEV :  หากพบเจอปัญหาโปรดแจ้งได้ตลออด ',
    'MJDEV :  ติดตามข่าวสารได้ที่ ..............',
    'MJDEV :  ห็ามอีโมคู่ทุกกรณี พบเจอแจ้ง',
    'MJDEV :  กด F5 เปิด-ปิด ไอดี-ชื่อและหลอดเลือด (กรุณาเปิดตลอดหากเจอเรื้อนกดแจ้ง)',
    'MJDEV :  หากพบเจอปัญหาโปรดแจ้งได้ตลออด ',
    'MJDEV :  รีประเทศ 17.00 น.',
    'MJDEV :  สนับสนุนประเทศได้ที่ F11',
}
-- รูป Logo ประเทศเปลี่ยนได้ที่ CSS บรรทัดที่ 45