-- ███╗░░░███╗░░░░░██╗██████╗░███████╗██╗░░░██╗
-- ████╗░████║░░░░░██║██╔══██╗██╔════╝██║░░░██║
-- ██╔████╔██║░░░░░██║██║░░██║█████╗░░╚██╗░██╔╝
-- ██║╚██╔╝██║██╗░░██║██║░░██║██╔══╝░░░╚████╔╝░
-- ██║░╚═╝░██║╚█████╔╝██████╔╝███████╗░░╚██╔╝░░
-- ╚═╝░░░░░╚═╝░╚════╝░╚═════╝░╚══════╝░░░╚═╝░░░
-- © 2026 MJDev | All rights reserved | Discord: discord.gg/gHRNMDQKzb
-- ห้ามนำไปจำหน่าย/แจกจ่าย/เผยแพร่ หรือแก้ไขเพื่อเผยแพร่ โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร

Citizen.CreateThread(function()
    local resourceName = GetCurrentResourceName()
    
    if resourceName ~= Config.ScriptName then
        print("^1======================================================^0")
        print("^1[MJDev ERROR] ตรวจพบการเปลี่ยนชื่อโฟลเดอร์สคริปต์!^0")
        print("^1กรุณาเปลี่ยนชื่อโฟลเดอร์กลับเป็น: ^3" .. Config.ScriptName .. "^0")
        print("^1======================================================^0")
        StopResource(resourceName)
        return
    end

    print("^2======================================================^0")
    print("^2[MJDev] " .. resourceName .. " Server Side Loaded Successfully!^0")
    print("^2======================================================^0")
end)