-- ███╗░░░███╗░░░░░██╗██████╗░███████╗██╗░░░██╗
-- ████╗░████║░░░░░██║██╔══██╗██╔════╝██║░░░██║
-- ██╔████╔██║░░░░░██║██║░░██║█████╗░░╚██╗░██╔╝
-- ██║╚██╔╝██║██╗░░██║██║░░██║██╔══╝░░░╚████╔╝░
-- ██║░╚═╝░██║╚█████╔╝██████╔╝███████╗░░╚██╔╝░░
-- ╚═╝░░░░░╚═╝░╚════╝░╚═════╝░╚══════╝░░░╚═╝░░░
-- © 2026 MJDev | All rights reserved | Discord: discord.gg/gHRNMDQKzb
-- ห้ามนำไปจำหน่าย/แจกจ่าย/เผยแพร่ หรือแก้ไขเพื่อเผยแพร่ โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร

Config = {}

-- ป้องกันการเปลี่ยนชื่อสคริปต์ (ชื่อโฟลเดอร์ต้องตรงกับชื่อนี้)
Config.ScriptName = "MJ-LoadingScreen"